EI/Resources/Sample_Inbound_Outbound/7.1/push_blueprint.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:blu="http://blueprint.sm.service.ei.erp.hp.com">
   <soapenv:Header/>
   <soapenv:Body>
      <blu:pushBPrequest>
                  <blueprint>&lt;?xml version="1.0" encoding="utf-8"?&gt;&#xA;&lt;Blueprint xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" OldnodeId="0C4294427625B113E10000000A114AB6" nodeId="005056871E661ED7A4BCAD9C3B8CA723" xsi:noNamespaceSchemaLocation=".\Blueprint.xsd"&gt;&#xA;  &lt;Name&gt;build project configuration for the first time by cindy&lt;/Name&gt;&#xA;  &lt;BusinessScenarios OldnodeId="" nodeId="005056871E661ED7A4BCAD9C3B8D0723"&gt;&#xA;    &lt;Name&gt;Business Scenarios&lt;/Name&gt;&#xA;    &lt;BusinessScenario OldnodeId="0C4294427625B113E10000000A114AB6" nodeId="005056871E661ED7A4BF1936C44A4723"&gt;&#xA;      &lt;Name&gt;Decommissioning&lt;/Name&gt;&#xA;      &lt;GeneralDocumentTab&gt;&#xA;        &lt;Document&gt;&#xA;          &lt;Name&gt;Decommissioning&lt;/Name&gt;&#xA;          &lt;DocumentType&gt;Scenario Documentation&lt;/DocumentType&gt;&#xA;          &lt;URL&gt;http://LABM3FTRND12.hpeswlab.net:08000/sap/bc/solman/SolmanDocuments/001?_CLASS=SOLARGEN%26_LOIO=A23B9C42E4560B22E10000000A114AB6%26LANGUAGE=EN%26RELEASE=620%26IWB_INDUSTRY=/KWCUST/%26TMP_IWB_TRY_OTHER_IND=X%26TMP_IWB_TRY_OTHER_LANG=X%26&lt;/URL&gt;&#xA;        &lt;/Document&gt;&#xA;      &lt;/GeneralDocumentTab&gt;&#xA;      &lt;BusinessProcesses OldnodeId="144294427625B113E10000000A114AB6" nodeId="005056871E661ED7A4BF1936C44BA723"&gt;&#xA;        &lt;Name&gt;Business Processes&lt;/Name&gt;&#xA;        &lt;BusinessProcess OldnodeId="B2231B41CD037001E10000000A114AB6" nodeId="005056871E661ED7A4BF19F7AA28A723"&gt;&#xA;          &lt;Name&gt;Asset Scrapping&lt;/Name&gt;&#xA;          &lt;GeneralDocumentTab&gt;&#xA;            &lt;Document&gt;&#xA;              &lt;Name&gt;Asset Scrapping&lt;/Name&gt;&#xA;              &lt;DocumentType&gt;Business Process Procedure&lt;/DocumentType&gt;&#xA;              &lt;URL&gt;http://LABM3FTRND12.hpeswlab.net:08000/sap/bc/solman/SolmanDocuments/001?_CLASS=SOLARGEN%26_LOIO=DAD977417FE69D6FE10000000A114AB6%26LANGUAGE=EN%26RELEASE=620%26IWB_INDUSTRY=/KWCUST/%26TMP_IWB_TRY_OTHER_IND=X%26TMP_IWB_TRY_OTHER_LANG=X%26&lt;/URL&gt;&#xA;            &lt;/Document&gt;&#xA;            &lt;Document&gt;&#xA;              &lt;Name&gt;Recording Time and Labor Data&lt;/Name&gt;&#xA;              &lt;DocumentType&gt;Process documentatn&lt;/DocumentType&gt;&#xA;              &lt;URL&gt;http://LABM3FTRND12.hpeswlab.net:08000/sap/bc/solman/SolmanDocuments/001?_CLASS=SOLARGEN%26_LOIO=A41F2343B5D0E33DE10000000A114AB6%26LANGUAGE=EN%26RELEASE=620%26IWB_INDUSTRY=/KWCUST/%26TMP_IWB_TRY_OTHER_IND=X%26TMP_IWB_TRY_OTHER_LANG=X%26&lt;/URL&gt;&#xA;            &lt;/Document&gt;&#xA;          &lt;/GeneralDocumentTab&gt;&#xA;          &lt;BusinessProcessStep OldnodeId="81CB323FFC81B222E10000000A114AB6" nodeId="005056871E661ED7A4BF19F7AA2F8723"&gt;&#xA;            &lt;Name&gt;Confirm time&lt;/Name&gt;&#xA;            &lt;ProjectDocumentTab&gt;&#xA;              &lt;Document&gt;&#xA;                &lt;Name&gt;Document1&lt;/Name&gt;&#xA;                &lt;DocumentType&gt;Accelerator&lt;/DocumentType&gt;&#xA;                &lt;URL&gt;http://LABM3FTRND12.hpeswlab.net:08000/sap/bc/solman/SolmanDocuments/001?_CLASS=SOLARGEN%26_LOIO=005056871E661ED7A4BF4DBB8BEC2723%26LANGUAGE=EN%26RELEASE=620%26IWB_INDUSTRY=/KWCUST/%26TMP_IWB_TRY_OTHER_IND=X%26TMP_IWB_TRY_OTHER_LANG=X%26&lt;/URL&gt;&#xA;              &lt;/Document&gt;&#xA;            &lt;/ProjectDocumentTab&gt;&#xA;            &lt;GeneralDocumentTab&gt;&#xA;              &lt;Document&gt;&#xA;                &lt;Name&gt;Recording Working Times&lt;/Name&gt;&#xA;                &lt;DocumentType&gt;Additional Documentation&lt;/DocumentType&gt;&#xA;                &lt;URL&gt;http://LABM3FTRND12.hpeswlab.net:08000/sap/bc/solman/SolmanDocuments/001?_CLASS=SOLARGEN%26_LOIO=1A862343CED1E13DE10000000A114AB6%26LANGUAGE=EN%26RELEASE=620%26IWB_INDUSTRY=/KWCUST/%26TMP_IWB_TRY_OTHER_IND=X%26TMP_IWB_TRY_OTHER_LANG=X%26&lt;/URL&gt;&#xA;              &lt;/Document&gt;&#xA;            &lt;/GeneralDocumentTab&gt;&#xA;            &lt;RequirementTab&gt;&#xA;              &lt;Requirement&gt;&#xA;                &lt;SM_reqId&gt;SOLARGEN  005056871E661ED7A4BF4DBB8BEC2723&lt;/SM_reqId&gt;&#xA;                &lt;Name&gt;Document1&lt;/Name&gt;&#xA;                &lt;URL&gt;http://LABM3FTRND12.hpeswlab.net:08000/sap/bc/solman/SolmanDocuments/001?_CLASS=SOLARGEN%26_LOIO=005056871E661ED7A4BF4DBB8BEC2723%26LANGUAGE=EN%26RELEASE=620%26IWB_INDUSTRY=/KWCUST/%26TMP_IWB_TRY_OTHER_IND=X%26TMP_IWB_TRY_OTHER_LANG=X%26&lt;/URL&gt;&#xA;              &lt;/Requirement&gt;&#xA;              &lt;Requirement&gt;&#xA;                &lt;SM_reqId&gt;SOLARGEN  1A862343CED1E13DE10000000A114AB6&lt;/SM_reqId&gt;&#xA;                &lt;Name&gt;Recording Working Times&lt;/Name&gt;&#xA;                &lt;URL&gt;http://LABM3FTRND12.hpeswlab.net:08000/sap/bc/solman/SolmanDocuments/001?_CLASS=SOLARGEN%26_LOIO=1A862343CED1E13DE10000000A114AB6%26LANGUAGE=EN%26RELEASE=620%26IWB_INDUSTRY=/KWCUST/%26TMP_IWB_TRY_OTHER_IND=X%26TMP_IWB_TRY_OTHER_LANG=X%26&lt;/URL&gt;&#xA;              &lt;/Requirement&gt;&#xA;            &lt;/RequirementTab&gt;&#xA;            &lt;Keywords&gt;&#xA;              &lt;Keyword&gt;&#xA;                &lt;KeywordID&gt;NOAM_KEY&lt;/KeywordID&gt;&#xA;                &lt;KeywordName&gt;TEST&lt;/KeywordName&gt;&#xA;              &lt;/Keyword&gt;&#xA;            &lt;/Keywords&gt;&#xA;            &lt;RelatedSAPobjects&gt;&#xA;              &lt;Object&gt;&#xA;                &lt;SAPObjectId&gt;IW41&lt;/SAPObjectId&gt;&#xA;                &lt;Name&gt;Enter PM Order Confirmation&lt;/Name&gt;&#xA;                &lt;Type&gt;Transaction&lt;/Type&gt;&#xA;                &lt;LogicalComponent&gt;SAP R/3&lt;/LogicalComponent&gt;&#xA;              &lt;/Object&gt;&#xA;              &lt;Object&gt;&#xA;                &lt;SAPObjectId&gt;IW42&lt;/SAPObjectId&gt;&#xA;                &lt;Name&gt;Overall Completion Confirmation&lt;/Name&gt;&#xA;                &lt;Type&gt;Transaction&lt;/Type&gt;&#xA;                &lt;LogicalComponent&gt;SAP R/3&lt;/LogicalComponent&gt;&#xA;              &lt;/Object&gt;&#xA;              &lt;Object&gt;&#xA;                &lt;SAPObjectId&gt;IW43&lt;/SAPObjectId&gt;&#xA;                &lt;Name&gt;Display PM Order Confirmation&lt;/Name&gt;&#xA;                &lt;Type&gt;Transaction&lt;/Type&gt;&#xA;                &lt;LogicalComponent&gt;SAP R/3&lt;/LogicalComponent&gt;&#xA;              &lt;/Object&gt;&#xA;              &lt;Object&gt;&#xA;                &lt;SAPObjectId&gt;IW44&lt;/SAPObjectId&gt;&#xA;                &lt;Name&gt;PM Order Collective Confirmation&lt;/Name&gt;&#xA;                &lt;Type&gt;Transaction&lt;/Type&gt;&#xA;                &lt;LogicalComponent&gt;SAP R/3&lt;/LogicalComponent&gt;&#xA;              &lt;/Object&gt;&#xA;              &lt;Object&gt;&#xA;                &lt;SAPObjectId&gt;IW45&lt;/SAPObjectId&gt;&#xA;                &lt;Name&gt;Cancel PM Order Confirmation&lt;/Name&gt;&#xA;                &lt;Type&gt;Transaction&lt;/Type&gt;&#xA;                &lt;LogicalComponent&gt;SAP R/3&lt;/LogicalComponent&gt;&#xA;              &lt;/Object&gt;&#xA;              &lt;Object&gt;&#xA;                &lt;SAPObjectId&gt;IW46&lt;/SAPObjectId&gt;&#xA;                &lt;Name&gt;Postprocessing of PDC Error Records&lt;/Name&gt;&#xA;                &lt;Type&gt;Transaction&lt;/Type&gt;&#xA;                &lt;LogicalComponent&gt;SAP R/3&lt;/LogicalComponent&gt;&#xA;              &lt;/Object&gt;&#xA;              &lt;Object&gt;&#xA;                &lt;SAPObjectId&gt;IW47&lt;/SAPObjectId&gt;&#xA;                &lt;Name&gt;Confirmation List&lt;/Name&gt;&#xA;                &lt;Type&gt;Transaction&lt;/Type&gt;&#xA;                &lt;LogicalComponent&gt;SAP R/3&lt;/LogicalComponent&gt;&#xA;              &lt;/Object&gt;&#xA;              &lt;Object&gt;&#xA;                &lt;SAPObjectId&gt;IW48&lt;/SAPObjectId&gt;&#xA;                &lt;Name&gt;Confirmation using operation list&lt;/Name&gt;&#xA;                &lt;Type&gt;Transaction&lt;/Type&gt;&#xA;                &lt;LogicalComponent&gt;SAP R/3&lt;/LogicalComponent&gt;&#xA;              &lt;/Object&gt;&#xA;            &lt;/RelatedSAPobjects&gt;&#xA;          &lt;/BusinessProcessStep&gt;&#xA;        &lt;/BusinessProcess&gt;&#xA;      &lt;/BusinessProcesses&gt;&#xA;    &lt;/BusinessScenario&gt;&#xA;  &lt;/BusinessScenarios&gt;&#xA;&lt;/Blueprint&gt;</blueprint>

          <qcContextInfo>
            <domainName>DEMO</domainName>
            <projectName>SM_Project_Try1</projectName>
         </qcContextInfo>
         <qcLoginInfo>
            <pw>qa</pw>
            <userName>qa</userName>
         </qcLoginInfo>
         <smProjectInfo>
            <smProjectId>CINDYPRO2</smProjectId>
            <smSystemId/>
         </smProjectInfo>
      </blu:pushBPrequest>
   </soapenv:Body>
</soapenv:Envelope>